app/Models/IklanModel.php

    public function semuaIklan()
    {
        return $this
            ->orderBy('updated_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `data_iklan`
ORDER BY `updated_at` DESC