app/Models/KatModel.php

    public function semuaKat()
    {
        return $this
            ->orderBy('updated_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `data_kat`
ORDER BY `updated_at` DESC