app/Models/PlatModel.php

SELECT *
FROM `data_plat`
ORDER BY `updated_at` DESC
---
    public function semuaPlat()
    {
        return $this
            ->orderBy('updated_at', 'DESC')
            ->findAll();