app/Models/PropModel.php

    public function getAllPropWithTipe(): array
    {
        return $this
            ->select('data_prop.*, data_tipe.*, data_prop.updated_at as prop_updated_at')
            ->join('data_tipe', 'data_tipe.tipe_id = data_prop.tipe_id')
            ->orderBy('prop_updated_at', 'DESC')
            ->findAll();
---
SELECT `data_prop`.*, `data_tipe`.*, `data_prop`.`updated_at` as `prop_updated_at`
FROM `data_prop`
JOIN `data_tipe` ON `data_tipe`.`tipe_id` = `data_prop`.`tipe_id`
ORDER BY `prop_updated_at` DESC