app/Models/TipeModel.php

    public function semuaTipe()
    {
        return $this
            ->orderBy('updated_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `data_tipe`
ORDER BY `updated_at` DESC