app/Models/TokoModel.php

    public function getAllTokoWithKatAndPlat()
    {
        return $this
            ->select('data_toko.*, data_kat.*, data_plat.*, data_toko.updated_at as toko_updated_at')
            ->join('data_kat', 'data_kat.kat_id = data_toko.kat_id')
            ->join('data_plat', 'data_plat.plat_id = data_toko.plat_id')
            ->orderBy('toko_updated_at', 'DESC')
            ->findAll();
---
SELECT `data_toko`.*, `data_kat`.*, `data_plat`.*, `data_toko`.`updated_at` as `toko_updated_at`
FROM `data_toko`
JOIN `data_kat` ON `data_kat`.`kat_id` = `data_toko`.`kat_id`
JOIN `data_plat` ON `data_plat`.`plat_id` = `data_toko`.`plat_id`
ORDER BY `toko_updated_at` DESC